[
    {
        "intro":"David-Michael went to the movies with his best friend.",
        "middle":"When he goes to use the bathroom, he steps on a Lego.",
        "punchline":"'Who brings Legos to a movie theater?' he asks."
    },
    {
        "intro":"Ethan walked into a grocery store.",
        "middle":"When he goes to buy a snack, he sees a Marvel movie poster.",
        "punchline":"'I should really go watch that movie,' he said."
    },
    {
        "intro":"Ethan and David-Michael were playing Uno this morning.",
        "middle":"Ethan sets down an Uno reverse card.",
        "punchline":"David-Michael says, 'Am I a joke to you?'"
    },
    {
        "intro":"Ethan and David-Michael decided to go hiking in the mountains.",
        "middle":"As they reached the summit, Ethan accidentally stepped on a loose rock.",
        "punchline":"David-Michael chuckled, 'Watch your step, Ethan!'"
    },
    {
        "intro":"David-Michael invited Ethan over to his house for a gaming marathon.",
        "middle":"Midway through their intense session, David-Michael's cat jumped onto Ethan's lap.",
        "punchline":"Ethan laughed, 'Looks like your cat wants to join our team!'"
    },
    {
        "intro":"Ethan was practicing his guitar in the park when David-Michael joined him.",
        "middle":"As they played a duet, a passerby stopped to listen and clapped enthusiastically.",
        "punchline":"Grinning, David-Michael said, 'We should start a band, Ethan!'"
    },
    {
        "intro":"David-Michael and Ethan decided to try their hand at baking cookies.",
        "middle":"As they pulled the tray out of the oven, they realized they had forgotten to add sugar.",
        "punchline":"Ethan sighed, 'Well, at least we know what not to do next time!'"
    },
    {
        "intro":"Ethan and David-Michael embarked on a road trip across the country.",
        "middle":"While driving through a small town, they stumbled upon a quirky roadside attraction.",
        "punchline":"David-Michael exclaimed, 'This is going straight to the top of our 'must-visit' list!'"
    },
    {
        "intro":"David-Michael challenged Ethan to a game of chess at the local park.",
        "middle":"ith a cunning move, Ethan put David-Michael's king in checkmate.",
        "punchline":"Laughing, David-Michael admitted, 'You got me this time, Ethan!"
    },
    {
        "intro":"Ethan and David-Michael volunteered at the animal shelter for the afternoon.",
        "middle":"While playing with the puppies, Ethan accidentally got licked on the face.",
        "punchline":"David-Michael teased, 'Looks like you made a new furry friend, Ethan!'"
    },


]